package project.Controllers;

import java.io.IOException;
import java.net.URL;
import java.util.ResourceBundle;
import javafx.fxml.FXML;
import javafx.fxml.FXMLLoader;
import javafx.scene.Parent;
import javafx.scene.Scene;
import javafx.scene.control.Button;
import javafx.scene.control.TextArea;
import javafx.scene.layout.AnchorPane;
import javafx.stage.Stage;

public class FitnessController {

    @FXML
    private ResourceBundle resources;

    @FXML
    private URL location;

    @FXML
    private Button backButton;

    @FXML
    private TextArea textArea;

    @FXML
    private Button aerobicButton;

    @FXML
    private Button strengthButton;

    @FXML
    private Button healthButton;

    @FXML
    private Button danceButton;
    @FXML
    private Button eastButton;

    @FXML
    void initialize() {
        backButton.setOnAction(event ->{
            backButton.getScene().getWindow().hide();
            FXMLLoader loader = new FXMLLoader();
            loader.setLocation(getClass().getResource("/View/ChooseView.fxml"));
            try {
                loader.load();
            } catch (IOException e) {
                e.printStackTrace();
            }
            Parent root = loader.getRoot();
            Stage stage = new Stage();
            stage.setScene(new Scene(root));
            stage.show();
        });
        aerobicButton.setOnAction(event -> {
            textArea.setText("Упражнение 1- Упражнение для рук\n" +
                    "Примите упор лежа, ноги прямые. Руки расставлены чуть шире плеч, спина должна быть прямой.\n" +
                    "На вдохе вытяните вперед правую руку и одновременно с ней поднимите вверх левую ногу.\n" +
                    "На выдохе вернитесь в исходное положение. Выполните 2–3 подхода по 8–12 раз для каждой стороны.\n" +
                    "Упражнение 2- Приставные шаги в сторону\n" +
                    "Поставьте ноги чуть шире, чем на ширину плеч, носки развернуты на 45 градусов.\n" +
                    "Согните ноги в коленях и опуститесь в полуприсед. Руки согнуты в локтях, локти над коленями (позиция А).\n" +
                    "Сделайте шаг в сторону левой ногой, колени при этом остаются согнутыми (позиция В).\n" +
                    "Теперь сделайте шаг в ту же сторону правой ногой.\n" +
                    "Упражнение 3- Подъем ноги в сторону из полуприседа\n" +
                    "Руки на талию, ноги на ширине плеч – это исходное положение.\n" +
                    "Согните ноги в колени и опуститесь в полуприсед. Выпрямляясь из положения полуприседа,\n" +
                    "одновременно поднимите правую ногу в сторону так высоко, как сможете. Вернитесь в исходное положение.");
        });
        strengthButton.setOnAction(event -> {
            textArea.setText("1.Отжимание от пола с колен\n" +
                    "Исходное положение. Упор на коленях, постановка выпрямленных рук немного шире плеч.\n" +
                    "Техника. На вдохе согни руки в локтях и опустись вниз до касания грудью пола (коврика).\n На выдохе вернись в исходное положение на выпрямленные руки.\n" +
                    "Количество. Выполни три сета по 20 повторений.\n" +
                    "2.Приседания\n" +
                    "Руки вытяните вперед, а затем медленно приседайте, медленно вставайте.\n" +
                    "Медленный темп нужен для того, чтобы напрягались именно те мышцы, которые нам нужны.\n" +
                    "Стул желательно выбирать такой, чтобы упражнение не показалось Вам сильно скучным.\n" +
                    "Другими словами — чтобы они был чуть выше коленного сустава.\n" +
                    "Таким образом, Вы обеспечите максимальные затраты энергии организма, позволив ему сжигать жир.\n" +
                    "3.Кобра\n" +
                    "Лягте лицом вниз на пол, руки вытяните вдоль тела ладонями вниз.\n" +
                    "Напрягите пресс и ягодицы и поднимите грудь от пола. Поднимайте и опускайте руки вдоль бедер.\n" +
                    "Поднимите ноги на расстояние 6 — 8 см от пола. Держите до счета 3 и опуститесь в исходное положение.");
        });
        healthButton.setOnAction(event -> {
            textArea.setText("1.Велосипед\n" +
                    "Нужно лечь на спину и разместить руки за головой. Колени следует согнуть и подтянуть к груди.\n" +
                    "Сразу же поднимаем верх туловища таким образом, чтобы оторвать лопатки от поверхности.\n" +
                    "Вытягивать шею нельзя. Выпрямляем левую ногу и тут же поворачиваем верх туловища в правую сторону.\n" +
                    "Левый локоть при этом тянется к правому колену. Затем выполняем то же действие на другую сторону –\n" +
                    "для этого нужно потянуть правый локоть к левому колену.\n" +
                    "2.Подъем таза на шаре\n" +
                    "Прежде всего, нужно положить шар (фитбол) в любое удобное место, лечь перед ним на спину и забросить на него ноги.\n" +
                    "Это ваша исходная позиция. Учтите, что касаться стопами шара нельзя. Теперь следует поднимать таз вверх,\n" +
                    "подкатив фитбол ногами ближе к себе. В высшей точке надо задержаться на 2-3 секунды и возвратиться к исходному положению\n" +
                    "3.«Маятник» с резинкой\n" +
                    "Нужно встать, выпрямиться, напрячь пресс и опустить вниз лопатки. Неопытные могут наступить на середину резинки,\n" +
                    "а ее концы взять по одному в каждую руку. Опытные спортсменки могут слегка утяжелиться 2-килограммовыми гантелями.\n" +
                    "Сперва надо согнуть правую руку и постепенно подвести ее к плечу. Затем руки следует поменять.\n" +
                    "Учтите, что ни в коем случае нельзя резко опускать руки. Внимательно смотрите, чтобы рука была постоянно согнута в локте.\n" +
                    "Повторы надо выполнять на протяжении 2 минут.\n");
        });
        danceButton.setOnAction(event -> {
            textArea.setText("1.Танцы живота\n" +
                    "Танцы живота (восточные танцы) сочетают в себе традиционные элементы Ближнего Востока и Северной Африки,\n" +
                    "однако популярность этого направления вышла далеко за пределы мест их возникновения. Наверное, каждому знакомы\n" +
                    "эти мягкие и плавные движения животом и бедрами, которые образуют едва ли не самый привлекательный танец в мире.\n" +
                    "Восточные танцы являются отличным вариантом кардио-тренировки для сжигания калорий и тонуса мышц средней части тела.\n" +
                    "2.Балетные тренировки\n" +
                    "Еще одно сверхпопулярное направление среди танцевальных тренировок – это занятия, основанные на балетных упражнениях (боди-балет).\n" +
                    "Такая тренировка включает в себя самые популярные движения из балета: деми-плие и гранд-плие, батманы вперед и назад,\n" +
                    "различные упражнения на полупальцах, упражнения на полу. Конечно, балетные тренировки – это не балет в чистом виде,\n" +
                    "а адаптированный комплекс упражнений для формирования красивого тела.\n" +
                    "3.Танцевальная аэробика\n" +
                    "Аэробика – это классика танцевально-спортивного направления. Аэробика переживала настоящий бум в 90-х годах,\n" +
                    "но и сейчас преданных поклонников этих тренировок очень много. В чем же ее суть? Танцевальная аэробика представляет собой\n" +
                    "набор несложных шагов, которые обычно идут на счет и в такт музыки. Шаги объединяются в хореографические связки,\n" +
                    "при этом их сложность может быть совершенно различной в зависимости от конкретного занятия и группы.\n");
        });
        eastButton.setOnAction(event -> {
            textArea.setText("1.Зумба\n" +
                    "Зумба – это одно из самых популярных танцевальных направлений последних лет. Зумба представляет собой смесь\n" +
                    "знаменитых латиноамериканских танцев: меренге, самба, реггетон, кумбия и сальса. В конце 90-х годов колумбийский танцор\n" +
                    "Альберто Перес разработал это спортивно-танцевальное направление, которое вмиг стало популярно во всем мире.\n" +
                    "Сегодня Зумбой занимаются почти во всех странах мира, и этот бешеный успех объяснить очень легко\n" +
                    "2.Латинские танцы\n" +
                    "Групповые занятия по латинским танцам также очень часто встречаются в различных танцевальных клубах и фитнес-центрах.\n" +
                    "Латинские танцы включают в себя движения и элементы хореографии из таких популярных направлений как сальса, меренге,\n" +
                    "бачата, румба, чачача, реггетон, самба. В отличие от Зумбы классы с латинскими танцами обычно более\n" +
                    "аутентичные и приближены к оригинальным танцевальным направлениям.\n" +
                    "3.Ирландский стэп\n" +
                    "Ирландский степ – это совершенно особенное танцевальное направление, которое покорило многих людей по всему миру.\n" +
                    "Особенность ирландского танца или риверденса заключается в четких и быстрых движениях ногами при сохранении неподвижности\n" +
                    "корпуса (наподобие чечетки). Кстати, для риверденса не всегда обязательно приобретать специальную обувь для характерного\n" +
                    "ритмичного стука ботинок, поскольку есть категория ирландских танцев, которая выполняется в мягкой обуви.\n");
        });

    }
}

