package project.Controllers;


import java.io.IOException;
import java.net.URL;
import java.util.ResourceBundle;
import javafx.fxml.FXML;
import javafx.fxml.FXMLLoader;
import javafx.scene.Parent;
import javafx.scene.Scene;
import javafx.scene.control.Button;
import javafx.scene.control.TextArea;
import javafx.stage.Stage;

public class RelaxController {

    @FXML
    private ResourceBundle resources;

    @FXML
    private URL location;

    @FXML
    private Button backButton;
    @FXML
    private Button massageButton;

    @FXML
    private Button hotSpringButton;

    @FXML
    private Button bathButton;

    @FXML
    private Button saunaButton;
    @FXML
    private TextArea textArea;

    @FXML
    void initialize() {
        backButton.setOnAction(event ->{
            backButton.getScene().getWindow().hide();
            FXMLLoader loader = new FXMLLoader();
            loader.setLocation(getClass().getResource("/View/ChooseView.fxml"));
            try {
                loader.load();
            } catch (IOException e) {
                e.printStackTrace();
            }
            Parent root = loader.getRoot();
            Stage stage = new Stage();
            stage.setScene(new Scene(root));
            stage.show();
        });
        massageButton.setOnAction(event -> {
            textArea.setText("1.Спортивный.\n" +
                    "Вариант применяется в качестве профилактики травматизма и подготовке к выступлениям у профессиональных спортсменов,\n" +
                    "и во время тренировочных занятий. Методика используется для устранения перенапряжения после пройденных выступлений;\n" +
                    "2.Mедицинский, или лечебный.\n" +
                    "Техника представляет собой поддержку, восстановление функций организма в реабилитационном этапе после болезни, или полученной травмы;\n" +
                    "3.Oбщая методика, или гигиенический вариант.\n" +
                    "В эту категорию входят расслабляющие, косметические виды процедуры, выполняемые для профилактики, общего укрепления самочувствия.\n");
        });
        bathButton.setOnAction(event -> {
            textArea.setText("Пoльзa плaвaния для Физичecкoгo здopoвья чeлoвeкa\n" +
                    "Люди пoceщaют бacceйн нe тoлькo paди удoвoльcтвия, нo и для oздopoвлeния.\n" +
                    "Этo oкaзывaeт блaгoпpиятнoe кoмплeкcнoe дeйcтвиe нa opгaнизм чeлoвeкa, зaщищaя eгo oт paзвития paзныx бoлeзнeй.\n" +
                    "Peгуляpныe вoдныe тpeниpoвки oбecпeчивaют pяд пpeимущecтв:\n" +
                    "1.Улучшeниe cepдeчнo-cocудиcтoй cиcтeмы\n" +
                    "2.Paзвитиe дыxaтeльныx opгaнoв\n" +
                    "3.Cжигaниe кaлopий\n" +
                    "4.Увeличeниe мышeчнoгo тoнуca и cилы\n" +
                    "5.Улучшeниe вынocливocти\n");
        });
        saunaButton.setOnAction(event -> {
            textArea.setText("Сауна, несомненно, укрепляет организм. Перепады температур способствуют повышению иммунитета,\n" +
                    "закаливанию и улучшению общего состояния здоровья. Человек попросту становится устойчивым к различным инфекционным\n" +
                    "заболеваниям. Поход в сауну нередко сопровождается нанесением эфирных масел, сеансами массажа и ароматерапией.\n" +
                    "Активные компоненты различных веществ с легкостью проникают через расширенные поры и положительно\n" +
                    "воздействуют на кожу и организм в целом. Итак, польза сауны для здоровья:\n" +
                    "Уничтожаются инфекции.\n" +
                    "Укрепляется иммунная система.\n" +
                    "Регулярное посещение сауны значительно снижает риск заболевания раком.\n" +
                    "Наружу из организма выводятся всевозможные токсины.\n" +
                    "Стабилизируется работа почек.\n" +
                    "Стабилизируется солевой обмен.\n" +
                    "Кожа становится чистой, мягкой, упругой и эластичной.\n" +
                    "Кровяное давление нормализуется благодаря тому, что расширяются сосуды и капилляры.\n" +
                    "Значительно снижается степень стресса.\n" +
                    "Исчезает раздражительность и нервозность.Исчезает усталость.\n" +
                    "Человеку возвращается бодрость и ясность мысли.\n" +
                    "Стимулируется работа головного мозга, вследствие чего развиваются умственные способности.");
        });
        hotSpringButton.setOnAction(event -> {
            textArea.setText("Термальная вода обладает противовоспалительным и обезболивающим эффектом, помогает укреплению иммунитета\n" +
                    "нормализует кровообращение и обменные процессы. Даже у практически здорового человека возле термального источника\n" +
                    "кожа приобретает бархатистость и свежесть, разглаживаются мелкие морщинки, восстанавливается сон.\n" +
                    "Через пару недель пребывания на курорте исчезают мышечные или суставные боли, улучшается общее самочувствие.\n" +
                    "О целебных особенностях термальной воды было известно много веков назад. Еще древние римские воины залечивали\n" +
                    "ранения после походов, принимая ванны. Одними из первых термальные источники стали использовать греки \n" +
                    "в античную эпоху, возводя термы – прообразы современных курортов. Но лишь в середине XIX века с помощью проведенных исследований\n" +
                    "был изучен состав воды и ее действие на организм человека. Так появилась целая наука – бальнеология.\n" +
                    "Сегодня эффект от использования термальных вод подтвержден результатами медицинских исследований.\n");
        });
    }
}
