package project.Controllers;

import java.io.IOException;
import java.net.URL;
import java.util.ResourceBundle;
import javafx.fxml.FXML;
import javafx.fxml.FXMLLoader;
import javafx.scene.Parent;
import javafx.scene.Scene;
import javafx.scene.control.Button;
import javafx.scene.control.TextArea;
import javafx.stage.Stage;

public class GymController {

    @FXML
    private ResourceBundle resources;

    @FXML
    private URL location;

    @FXML
    private Button backButton;

    @FXML
    private Button dietEasyLegsButton;

    @FXML
    private Button dietEasyHandsButton;

    @FXML
    private Button dietEasyPressButton;

    @FXML
    private Button dietEasyBreastButton;

    @FXML
    private Button dietMediumHandsButton;

    @FXML
    private Button dietMediumLegsButton;

    @FXML
    private Button dietMediumPressButton;

    @FXML
    private Button dietMediumBreastButton;

    @FXML
    private Button dietHardHandsButton;

    @FXML
    private Button dietHardLegsButton;

    @FXML
    private Button dietHardPressButton;

    @FXML
    private Button dietHardBreastButton;

    @FXML
    private Button stretchingEasyHandsButton;

    @FXML
    private Button stretchingEasyLegsButton;

    @FXML
    private Button stretchingEasyPressButton;
    @FXML
    private Button stretchingEasyBreastButton;

    @FXML
    private Button stretchingMediumHandsButton;

    @FXML
    private Button stretchingMediumLegsButton;

    @FXML
    private Button stretchingMediumPressButton;

    @FXML
    private Button stretchingMediumBreastButton;

    @FXML
    private Button stretchingHardHandsButton;

    @FXML
    private Button stretchingHardLegsButton;

    @FXML
    private Button stretchingHardPressButton;

    @FXML
    private Button stretchingHardBreastButton;

    @FXML
    private Button massEasyHandsButton;

    @FXML
    private Button massEasyLegsButton;

    @FXML
    private Button massEasyPressButton;

    @FXML
    private Button massEasyBreastButton;

    @FXML
    private Button massMediumHandsButton;

    @FXML
    private Button massMediumLegsButton;

    @FXML
    private Button massMediumPressButton;

    @FXML
    private Button massMediumBreastButton;

    @FXML
    private Button massHardHandsButton;

    @FXML
    private Button massHardLegsButton;

    @FXML
    private Button massHardPressButton;

    @FXML
    private Button massHardBreastButton;

    @FXML
    private TextArea textArea;

    @FXML
    void initialize() {
        backButton.setOnAction(event ->{
            backButton.getScene().getWindow().hide();
            FXMLLoader loader = new FXMLLoader();
            loader.setLocation(getClass().getResource("/View/ChooseSportView.fxml"));
            try {
                loader.load();
            } catch (IOException e) {
                e.printStackTrace();
            }
            Parent root = loader.getRoot();
            Stage stage = new Stage();
            stage.setScene(new Scene(root));
            stage.show();
        });

        textArea.setEditable(false);
        dietEasyHandsButton.setOnAction(event -> {
            textArea.setText("1. Подъемы и опускания в планке\n" +
                    "  Встаньте в планку. Руки на уровне плеч. \n" +
                    "По очереди согните руки и опуститесь в планку на локтях. \n" +
                    "Снова вернитесь в исходное положение, поочередно выпрямив руки. \n" +
                    "Совет: начинайте опускание и подъем с разных рук.\n" +
                    "2. Отжимания\n" +
                    "  Встаньте в планку, руки поставьте на уровне плеч, близко друг к другу — так, чтобы большие и указательные пальцы образовывали треугольник. \n" +
                    "Отожмитесь в этом положении. Если это слишком трудно, опуститесь на колени и отжимайтесь так. \n" +
                    "Отжимания можно варьировать с берпи, если хотите сделать тренировку более разнообразной.");
        });
        dietEasyLegsButton.setOnAction(event ->{
            textArea.setText("1. Приседания\n" +
                    "  Исходное положение: стопы на ширине таза. \n" +
                    "На вдохе приседаем до параллели бедра с полом, колени не выходят за край стопы, вес переносим на пятки. \n" +
                    "Финальное положение: на выдохе возвращаемся в исходное положение. \n" +
                    "В качестве отягощения берем гантель либо бодибар.\n" +
                    "2. Выпады\n" +
                    "  Стопы на ширине таза. \n" +
                    "Шагаем ногой назад и на вдохе опускаем таз вниз. \n" +
                    "В нижней точке оба колена образуют прямой угол. \n" +
                    "На выдохе возвращаемся в исходное положение. \n" +
                    "После нужного количества повторений меняем ногу." +
                    "Затем выполняют упражнение для другой ноги.\n");
        });
        dietEasyPressButton.setOnAction(event -> {
            textArea.setText("1. Прямые скручивания \n" +
                    "  Лягте на спину, колени слегка согните. \n" +
                    "Поясницу прижмите к полу. \n" +
                    "Работая мышцами пресса, на выдохе поднимите лопатки над полом, руки вытяните вперед, коснитесь ладонями коленей. \n" +
                    "Не напрягайте шею и плечи. \n" +
                    "Плавно опуститесь спиной на коврик. \n" +
                    "2. Вращение ногами из положения лежа\n" +
                    "  Сядьте на коврик с прямыми ногами. \n" +
                    "Слегка откиньтесь корпусом назад. \n" +
                    "Согните руки в локтях, уведите чуть назад и обопритесь на предплечья. \n" +
                    "Согните ноги в тазобедренном суставе и вытяните их вверх. \n" +
                    "Крестец прижмите к полу. \n" +
                    "Работая мышцами пресса, кора и бедер плавно уведите мыски и прямые ноги влево, вернитесь в центр и опустите их вправо.");
        });
        dietEasyBreastButton.setOnAction(event ->{
            textArea.setText("1. Сжимание ладоней \n" +
                    "  Концентрируем внимание на сокращении мышц. \n" +
                    "Медленно сжимаем ладони рук, расположенных перед грудью. \n" +
                    "Пальцы направлены строго вверх. \n" +
                    "На максимальном усилии задерживаемся на несколько секунд и постепенно разжимаем ладони. Можно визуально определить пользу выполняемого упражнения – на максимуме сжатия ладоней бюст немного приподнимается. \n" +
                    "2. Отжимания от стены\n" +
                    " Чем дальше мы становимся от стены, тем большая нагрузка идёт на мышцы. \n" +
                    "Становимся на шаг от стены. \n" +
                    "Выполняем отжимания, сгибая и разгибая руки в локтях.");
        });
        dietMediumHandsButton.setOnAction(event -> {
            textArea.setText("1. Отжимания спиной вперед\n" +
                    "  Сядьте, вытянув ноги, спиной касаясь опорного предмета (можно использовать обычную табуретку). \n" +
                    "Упритесь руками в опору за спиной так, чтобы пальцы смотрели вперед. Руки должны быть согнуты в локтях. \n" +
                    "Выпрямите руки, чтобы приподнять туловище от пола, а затем снова согните руки и опуститесь. \n" +
                    "Совет: держите пятки на полу и убедитесь, что локти смотрят прямо назад.\n" +
                    "2. Наклоны с гантелями\n" +
                    "  Возьмите в обе руки гантели комфортного для вас веса. \n" +
                    "Руки вдоль туловища. \n" +
                    "Постепенно наклонитесь вправо, опуская правую руку и одновременно поднимая левую. \n" +
                    "Замрите в наклоне на пару секунд. \n" +
                    "Медленно вернитесь в исходное положение.");
        });
        dietMediumLegsButton.setOnAction(event ->{
            textArea.setText("1. Подъемы таза лежа\n" +
                    "  Ноги согнуты, руки вдоль корпуса либо удерживают отягощение (диск, боди бар, гантель). \n" +
                    "На вдохе поднимаем таз вверх, сокращая ягодичные мышцы, на вдохе возвращаемся в исходное положение.\n" +
                    "2. Отведение ног в сторону\n" +
                    "  Лежа на боку кладем отягощение ближе к коленному суставу, сокращаем стопу и на выдохе отводим ногу в сторону. \n" +
                    "На вдохе возвращаемся в исходное положение.");
        });
        dietMediumPressButton.setOnAction(event -> {
            textArea.setText("1. Боковая планка в динамике \n" +
                    "  Лягте на правый бок, правую руку согните в локте и обопритесь на предплечье. \n" +
                    "Ноги вытяните и упритесь в пол боковыми поверхностями стоп, левую руку разместите на бедре. Не прогибайтесь в пояснице. \n" +
                    "С выдохом оторвите таз от пола, работайте мышцами пресса и спины. \n" +
                    "Зафиксируйтесь в верхней точке на 3-4 секунды, вернитесь в исходное положение. \n" +
                    "2. Скручивания с подъемом таза \n" +
                    "  Лягте на спину, руки соедините в замок на затылке. \n" +
                    "Расслабьте шею и плечи. \n" +
                    "Поясницу прижмите к полу. \n" +
                    "Ноги вытяните вверх, скрестив лодыжки. \n" +
                    "На выдохе, работая мышцами пресса, одновременно поднимите над ковриком лопатки и таз. \n" +
                    "Плавно вернитесь в исходное положение.");
        });
        dietMediumBreastButton.setOnAction(event ->{
            textArea.setText("1. Берпи\n" +
                    "  Выполняем глубокое приседание, ладонями упираемся в пол. \n" +
                    "Ложимся и отжимаемся от пола. \n" +
                    "Возвращаемся в присед, выпрыгиваем вверх, поднимая высоко руки, и опять приседаем. \n" +
                    "2. Обратная планка\n" +
                    "  Садимся на пол, отведённые назад руки ладонями упираем в пол. \n" +
                    "Руки разворачиваем пальцами, направленными в сторону пяток. \n" +
                    "Ноги сгибаем в коленях под углом девяносто градусов, опираясь на всю ступню. \n" +
                    "Голову не поднимаем и не опускаем. \n" +
                    "В данной позе находимся несколько секунд. \n" +
                    "Садимся на пол и расслабляем мышцы тридцать секунд.");
        });
        dietHardHandsButton.setOnAction(event -> {
            textArea.setText("1. Хождение в планке\n" +
                    "  Встаньте в планку поперек коврика. \n" +
                    "Сделайте одновременно шаг правой ногой и правой рукой в сторону. Немедленно подтяните левую ногу и левую руку. \n" +
                    "Сделайте три таких шага в одну сторону и вернитесь обратно таким же образом. \n" +
                    "Повторите по 30 раз в каждую сторону.\n" +
                    "2. Отжимания в стойке\n" +
                    "  Встаньте на руки лицом к стене. Расстояние до стены — 50-60 см. \n" +
                    "Расположите руки чуть шире плеч, упирайтесь в стену ступнями. \n" +
                    "Осторожно согните локти, почувствуйте напряжение в плечах и спине. \n" +
                    "Выпрямите руки. \n" +
                    "Повторите 10 раз. \n" +
                    "Совет: чем ближе вы встанете к стене, тем легче будут отжимания. Кроме того, чем ближе вы поставите руки друг к другу, тем устойчивее вы будете. \n" +
                    "Но будьте осторожны! Если вы новичок в стойках на руках, не экспериментируйте, а делайте в комфортном для себя положении.");
        });
        dietHardLegsButton.setOnAction(event ->{
            textArea.setText("1. Махи ногой назад и вбок\n" +
                    "  Стоим на коленях с опорой на ладони либо предплечья. \n" +
                    "Под колено кладем гантель либо надеваем на голень утяжелители. \n" +
                    "На выдохе делаем мах ногой назад (согнутой или прямой), на вдохе возвращаемся в исходное положение.\n" +
                    "2. Прыжки с подъемом ног\n" +
                    "  Встать лицом к скамье, стулу, дивану или ящику, положив руки на талию. \n" +
                    "Выпрыгивать сначала левой ногой на возвышение, удерживая 90 градусов в колене, а затем поменять местами ноги и повтори то же самое на правую ногу, быстро чередуя стороны. \n" +
                    "При этом держать спину прямо, а грудь все время поднятой.");
        });
        dietHardPressButton.setOnAction(event -> {
            textArea.setText("1. Подъемы корпуса на фитболе\n" +
                    "  Лягте на фитбол левым боком, разместив на мяче корпус и таз. \n" +
                    "Ноги вытяните и упритесь в пол боковыми поверхностями стоп. \n" +
                    "Левую руку согните и положите ладонь на затылок. \n" +
                    "Правой рукой слегка опирайтесь на мяч перед собой. Работая мышцами пресса и кора, на выдохе плавно оторвите верхнюю часть корпуса от фитбола. \n" +
                    "Не сутультесь и не прогибайтесь в пояснице. \n" +
                    "Со вдохом вернитесь в исходное. \n" +
                    "2. Динамическая планка\n" +
                    "  Примите упор лежа на прямых руках. \n" +
                    "Не усиливайте прогиб в пояснице, расслабьте шею и плечи. \n" +
                    "Активизируйте мышцами передней поверхности тела – мускулатуру корпуса, бедер, рук. \n" +
                    "Затем поочередно согните локти и опуститесь в планку на предплечьях. \n" +
                    "Вернитесь в исходное положение.");
        });
        dietHardBreastButton.setOnAction(event ->{
            textArea.setText("1. Жим гантелей лежа\n" +
                    "  Ложимся на пол. \n" +
                    "Берём гантели, расположенные рядом. \n" +
                    "Ноги слегка расставляем, сгибаем в коленях и упираемся в пол. \n" +
                    "Выжимаем гантели, расположенные в области груди, вверх. \n" +
                    "2. С табуреткой\n" +
                    "  На табурет садятся и разводят по сторонам руки, локти пытаются сблизить между собой. \n" +
                    "Напряжение мышц груди должно хорошо почувствоваться при выполнении где-то на десятом движении.");
        });


        //
        // buttons
        //


        stretchingEasyHandsButton.setOnAction(event -> {
            textArea.setText(" \n" +
                    "1. Растяжка трицепсов\n" +
                    "  Подойдите к стене, поднимите левый локоть вверх, предплечье заведите за спину. \n" +
                    "Опустите левую лопатку вниз. \n" +
                    "Чтобы проверить, что она действительно опустилась и не будет подниматься во время растяжки, положите правую руку ниже левой подмышки. \n" +
                    "Повторите на другую сторону.\n" +
                    "2. Растяжка передней части плеча\n" +
                    "  Заведите руки за спину, обхватите одной рукой запястье второй. \n" +
                    "Согните локти и поднимите запястья выше. \n" +
                    "Подайте грудь вперёд и почувствуйте растяжение передней части плеч.");
        });
        stretchingEasyLegsButton.setOnAction(event ->{
            textArea.setText("1. Растяжка сидя\n" +
                    "  Сядьте на пол, вытяните ноги вперёд, выпрямите спину. \n" +
                    "Согните одну ногу в колене, возьмитесь за голень руками и прижмите её к груди. \n" +
                    "Голень должна быть параллельна полу, предплечья лежат сверху и прижимают её к груди, одна кисть накрывает другую. \n" +
                    "Повторите с другой ногой.\n" +
                    "2. Растяжка квадрицепса лежа\n" +
                    "  Лягте на пол на живот, поднимите одну ногу и возьмитесь рукой на лодыжку. \n" +
                    "Притяните ногу к ягодице, стараясь не отрывать бедро от пола. \n" +
                    "Повторите с другой ногой.");
        });
        stretchingEasyPressButton.setOnAction(event -> {
            textArea.setText("1. Поза верблюда\n" +
                    "  Встаньте на колени, подайте грудь вверх, вытягивая позвоночник, а затем отклонитесь назад, положив руки на пятки. \n" +
                    "Старайтесь прогибаться в грудном отделе. \n" +
                    "Голову не запрокидывайте, смотрите вверх.\n" +
                    "2. Поза собоки мордой вверх\n" +
                    "  Лягте на пол на живот, поставьте руки под плечи. \n" +
                    "Выжмите себя наверх, таз приподнимается, ноги остаются на полу. \n" +
                    "Опустите плечи, прогнитесь в грудном отделе.");
        });
        stretchingEasyBreastButton.setOnAction(event ->{
            textArea.setText("1. Растяжка груди в дверном проёме\n" +
                    "  Подойдите к дверному проёму, обопритесь о косяки локтями и подайте грудь вперёд, растягивая грудные мышцы.\n" +
                    "2. Растяжка груди у стены\n" +
                    "  Поставьте руку на стену, опустите плечо и развернитесь в противоположную сторону. \n" +
                    "Повторите с другой рукой.");
        });
        stretchingMediumHandsButton.setOnAction(event -> {
            textArea.setText("1. Растяжка бицепсов\n" +
                    "  Возьмитесь за ручку двери, стойку или другую опору, повернитесь к ней спиной. \n" +
                    "Разверните руку локтем наверх и подайте корпус чуть вперёд.\n" +
                    "2. Растяжка средней части плеча\n" +
                    "  Возьмитесь рукой за противоположный локоть, прижмите плечо к себе и потяните его вниз. \n" +
                    "Повторите с другой рукой.");
        });
        stretchingMediumLegsButton.setOnAction(event ->{
            textArea.setText("1. Глубокий выпад\n" +
                    "  Сделайте глубокий выпад вперёд. \n" +
                    "Пальцы рук поставьте на пол по обе стороны от стопы. Колено выпрямленной ноги опустите на пол. \n" +
                    "Старайтесь опуститься ниже и не разворачивайте таз в сторону.\n" +
                    "2. Наклон к ногам\n" +
                    "  Сядьте на пол, вытяните прямые ноги вперёд. \n" +
                    "Наклонитесь к ногам и положите руки по обе стороны от стоп или чуть дальше. \n" +
                    "Чтобы углубить растяжку, можете выпрямить спину на несколько секунд, а затем снова наклониться.");
        });
        stretchingMediumPressButton.setOnAction(event -> {
            textArea.setText("1. Прогиб назад стоя\n" +
                    "  Встаньте прямо, ноги вместе. \n" +
                    "Поднимите руки и соедините ладони над головой. \n" +
                    "Прогнитесь в грудном отделе и откиньте корпус назад. \n" +
                    "Напрягите ягодицы, чтобы исключить сильный прогиб в пояснице.\n" +
                    "2. Скручивания позвоночника лежа\n" +
                    "  Лягте на пол на спину, руки раскиньте в стороны ладонями вниз. \n" +
                    "Подвиньте таз влево, поднимите левую ногу, согнув её в колене, заведите её за правую ногу и постарайтесь положить колено на пол. \n" +
                    "Поверните голову влево и расслабьтесь.");
        });
        stretchingMediumBreastButton.setOnAction(event ->{
            textArea.setText("1. Вариация позы \"собака мордой вниз\"\n" +
                    "  Это упражнение можно делать около шведской стенки, стеллажа и тому подобном. \n" +
                    "Отойдите от стены на такое расстояние, чтобы при наклоне и касании стены ваше тело стало параллельно полу. \n" +
                    "Держите спину прямой. \n" +
                    "Подайте грудь вперёд, чтобы широчайшие и грудные мышцы лучше растянулись.\n" +
                    "2. Растяжка грудис партнёром\n" +
                    "  Ложитесь на пол на живот. \n" +
                    "Положите руки вдоль тела ладонями вниз. \n" +
                    "Партнёр должен встать над вами, взять ваши руки, поднять их и тянуть на себя. \n" +
                    "Вы должны почувствовать глубокую растяжку в мышцах груди. \n" +
                    "Не делайте это упражнение, если есть проблемы с мышцами-ротаторами плеча.");
        });
        stretchingHardHandsButton.setOnAction(event -> {
            textArea.setText("1. Растяжка трицепсов и плеч\n" +
                    "  Эта поза позволяет одновременно растянуть трицепс одной руки и переднюю часть плеча другой. \n" +
                    "Одну руку заведите за спину сверху, чтобы локоть смотрел наверх, а вторую снизу — локоть смотрит в пол. \n" +
                    "Постарайтесь соединить запястья за спиной на уровне лопаток.\n" +
                    "2. Растяжка разгибателей запястья\n" +
                    "  Сядьте на колени, поставьте перед собой руки так, чтобы тыльные стороны кистей касались пола, а пальцы были направлены друг к другу. \n" +
                    "Осторожно перенесите вес на руки, растягивая предплечья. \n" +
                    "Чтобы усилить эффект, попробуйте сжать кулаки.");
        });
        stretchingHardLegsButton.setOnAction(event ->{
            textArea.setText("1. Поперечный шпагат\n" +
                    "  Разъезжайтесь в поперечный шпагат. \n" +
                    "Не отводите таз сильно назад, в идеале он должен находиться на одной линии с коленями и стопами. \n" +
                    "Поставьте на пол ладони, а если позволяет растяжка — предплечья. \n" +
                    "Тяните таз вниз, к полу.\n" +
                    "2. Растяжка рядом со стеной\n" +
                    "  Лягте на пол вплотную к стене. \n" +
                    "Тело должно быть перпендикулярно ей. \n" +
                    "Раздвиньте ноги и позвольте им медленно опускаться под своим весом. \n" +
                    "Задержитесь в таком положении на 5–10 минут.");
        });
        stretchingHardPressButton.setOnAction(event -> {
            textArea.setText("1. Наклон вбок\n" +
                    "  Встаньте прямо, поднимите руки над головой, сцепите пальцы в замок и выверните ладонями вверх. \n" +
                    "Потянитесь вверх и наклонитесь сначала в одну, а потом в другую сторону.\n" +
                    "2. Скручивания позвоночника лежа \n" +
                    "  Лягте на пол на спину, руки раскиньте в стороны ладонями вниз. \n" +
                    "Подвиньте таз влево, поднимите левую ногу, согнув её в колене, заведите её за правую ногу и постарайтесь положить колено на пол. \n" +
                    "Поверните голову влево и расслабьтесь.");
        });
        stretchingHardBreastButton.setOnAction(event ->{
            textArea.setText("1. Вариация позы \"собака мордой вниз\"\n" +
                    "  Это упражнение можно делать около шведской стенки, стеллажа и тому подобном. \n" +
                    "Отойдите от стены на такое расстояние, чтобы при наклоне и касании стены ваше тело стало параллельно полу. \n" +
                    "Держите спину прямой. \n" +
                    "Подайте грудь вперёд, чтобы широчайшие и грудные мышцы лучше растянулись.\n" +
                    "2. Растяжка грудис партнёром\n" +
                    "  Ложитесь на пол на живот. \n" +
                    "Положите руки вдоль тела ладонями вниз. \n" +
                    "Партнёр должен встать над вами, взять ваши руки, поднять их и тянуть на себя. \n" +
                    "Вы должны почувствовать глубокую растяжку в мышцах груди. \n" +
                    "Не делайте это упражнение, если есть проблемы с мышцами-ротаторами плеча.");
        });


        //
        //Mass Buttons
        //


        massEasyHandsButton.setOnAction(event -> {
            textArea.setText("1. Отжимания, узкая постановка локтей (трицепс) \n" +
                    "  Упор лёжа, руки на расстоянии уже плеч, пальцы смотрят вперёд. \n" +
                    "На вдохе опускается грудь, локти уходят вдоль тела. \n" +
                    "На выдохе грудь поднять. \n" +
                    "2. Подтягивание на перекладине с узким хватом \n" +
                    "  Подтягивания на плечи\n" +
                    "Повиснуть на перекладине, ладони расположены на расстоянии уже плеч, смотрят вперёд, поясницу слегка прогнуть, грудь выставить. \n" +
                    "Одновременно с выдохом туловище поднимается пока грудь не коснётся перекладины. Движение должно быть совершено с помощью силы рук, торс и ноги должны оставаться неподвижными. \n" +
                    "После паузы в 1 секунду принять исходное положение. \n" +
                    "3. Поднятие гантелей или иных отягощений на плечи \n" +
                    " Стоя, спина ровная, взять гантель в руку. \n" +
                    "На выдохе правая рука сгибается в локте пока гантель не коснётся груди. \n" +
                    "На вдохе рука возвращается на место. Повторить то же самое с левой.");
        });
        massEasyLegsButton.setOnAction(event ->{
            textArea.setText("1. Приседания с широкой постановкой ног\n" +
                    "  Ноги поставить шире плеч; \n" +
                    "Носки развернуть на 120 градусов; \n" +
                    "Приседать вниз так, чтобы бёдра оказались параллельны полу, а голень – перпендикулярно; \n" +
                    "Ягодицы отводятся назад, а спина немного вперёд; \n" +
                    "Спину удерживать на одной прямой, не круглить плечи; \n" +
                    "Напрячь пресс для поддержки спины; \n" +
                    "При подъёме вверх напрягать ягодичные мышцы.\n" +
                    "2. Фронтальные приседания\n" +
                    "  Гриф кладётся на плечи и грудь, обхватывается руками сверху крест-накрест, либо тяжелоатетическим хватом; \n" +
                    "Положение стоп – чуть уже, чем в приседаниях со Штангой на плечах, носки также развёрнуты наружу; \n" +
                    "Спина удерживается в максимально возможном вертикальном положении; \n" +
                    "Вес для фронтальных приседаний со штангой на груди стоит взять меньший, чем для приседаний со штангой на плечах.\n");
        });
        massEasyPressButton.setOnAction(event -> {
            textArea.setText("1. Подъём ног в висе\n" +
                    "  Ноги немного согнуть в коленях; \n" +
                    "При подъёме ног старайтесь бедрами коснуться живота, поднять ноги выше параллели; \n" +
                    "Не раскачивайтесь и выполняйте упражнение за счёт мышц пресса, а не инерции\n" +
                    "2. Скручивания\n" +
                    "  Руки за головой или скрещены перед собой (также можно вытянуть их вверх); \n" +
                    "Сжимайте мышцы пресса и отрывайте плечи от пола на выдохе; \n" +
                    "На вдохе опускайтесь вниз; \n" +
                    "Амплитуда движения очень маленькая, низ спины всегда прижат к полу.\n" +
                    "3. Наклоны в стороны с гантелей\n" +
                    "  Возьмите гантелю в левую руку; \n" +
                    "Наклонитесь как можно ниже вправо, напрягая косые мышцы; \n" +
                    "Задержитесь на секунду и вернитесь в исходное положение; \n" +
                    "Выполните необходимое количество повторений, Возьмите гантелю в правую руку и повторите упражнение для другой стороны.");
        });
        massEasyBreastButton.setOnAction(event ->{
            textArea.setText("1. Жим гантелей лёжа\n" +
                    "  Лёжа на скамье, согните руки с гантелями под углом 90%, плечо параллельно полу или чуть ниже; \n" +
                    "На выдохе выжмите гантели вверх; выжимая гантели Сжимайте мышцы груди, опуская вниз – растягивайте; \n" +
                    "В нижней точке старайтесь дополнительно сжать лопатки.\n" +
                    "2. Отжимания на брусьях\n" +
                    "  Упритесь прямыми руками в брусья, наклоните спину вперёд, таз отведите назад; \n" +
                    "Опуститесь вниз, согнув руки, – плечо перпендикулярно полу, а локти смотрят в потолок; \n" +
                    "Не задирайте плечи к ушам, выгните спину и не вываливайте живот.\n" +
                    "3. Разводка гантелей\n" +
                    "  Лёжа на скамье поднимите руки с гантелями перед собой, ладонями к себе; \n" +
                    "Немного согните локти; \n" +
                    "Опустите руки вниз через стороны, растягивая грудь и сжимая лопатки; \n" +
                    "Поднимите руки в исходное положение, сжимая мышцы груди.");
        });
        massMediumHandsButton.setOnAction(event -> {
            textArea.setText("1. Французский жим\n" +
                    "  Выпрямленные руки отведите вверх, расположив их перпендикулярно относительно поверхности пола. \n" +
                    "Возьмите снаряд верхним хватом, руки выровняйте и отведите назад на 40° от вертикали. \n" +
                    "Сделав вдох и задержав дыхание, опустите гриф к затылку, согнув локти, при этом верхняя часть рук остается в фиксированном положении. \n" +
                    "Угол в локтях снизу составляет 90°. \n" +
                    "Доведя штангу до крайней точки внизу, разогните руки и верните ее в начальное положение.\n" +
                    "2. «Молотки»\n" +
                    "  Гантели удерживайте простым хватом, незначительно прогибаясь в пояснице. \n" +
                    "Руки опустите к бедрам, делая вдох и задерживая дыхание для последующего поднимания гантели к дельте. \n" +
                    "Прижмите локти к туловищу и не шевелите ими при выполнении упражнения. \n" +
                    "Кисть задерживается у груди на пару секунд, после чего делается выдох и она опускается в ИП.");
        });
        massMediumLegsButton.setOnAction(event ->{
            textArea.setText("1. Сплит-присед \n" +
                    "  Положить штангу на плечи (или взять гантели); \n" +
                    "Сделать выпад одной ногой вперёд, при этом носок передней ноги немного повёрнут внутрь, а пятка задней – наружу (это поможет дополнительно стабилизировать туловище); \n" +
                    "Задняя нога согнута в колене не касаясь пола; \n" +
                    "Колено передней ноги не выходит за носок, при этом чем ближе колено к носку, тем больше акцент на квадрицепс, чем дальше от него – тем сильнее задействуются ягодичные; \n" +
                    "Выпрямить ноги, ступни остаются на месте; \n" +
                    "Затем снова согнуть обе ноги , при этом туловище не подаётся вперёд, а остаётся перпендикулярным полу – сгибая и разгибая ноги Вы двигаете его вверх и вниз, а не взад-вперёд; \n" +
                    "Повторить упражнение для другой ноги.\n" +
                    "2. Гиперэкстензия\n" +
                    "  Чтобы больше задействовать ноги и ягодицы, а не спину, нужно лечь на тренажёр так, чтобы тазовые кости были чуть выше подушек. \n" +
                    "Важно возвращаясь в исходное положение не переразгибать спину, а держать её на одной прямой с ногами. \n" +
                    "Упражнение можно выполнять как с блином, так и со штангой.");
        });
        massMediumPressButton.setOnAction(event -> {
            textArea.setText("1. Подъём ног лёжа на скамье\n" +
                    "  Обхватите руками края скамьи; \n" +
                    "Во время подъёма ноги немного согнуты в коленях; \n" +
                    "В верхней точке нужно оторвать ягодицы от скамьи; \n" +
                    "Выполняйте упражнение за счёт мышц пресса, а не инерции; \n" +
                    "При подъёме ног на наклонной скамье нагрузка на мышцы пресса возрастает.\n" +
                    "2. Планка\n" +
                    "  Положение тела как во время отжиманий, но упор на локти; \n" +
                    "Локти находятся строго под плечевыми суставами; \n" +
                    "Плечи перпендикулярно полу; \n" +
                    "Таз не отклячивать назад и не опускать вниз – ноги и спина на одной прямой; \n" +
                    "Планку нужно удерживать 30-60 секунд.");
        });
        massMediumBreastButton.setOnAction(event ->{
            textArea.setText("1. Жим штанги лёжа\n" +
                    "  Лягте на скамью таким образом, чтобы взгляд был на уровне грифа; \n" +
                    "Руками возьмитесь за штангу, ширина хвата – средняя (шире плеч, около 55-60см); \n" +
                    "Снимите штангу с держателей, исходное положение – локти полностью выпрямлены, руки перпендикулярны полу, гриф находится на уровне верха груди; \n" +
                    "Допустим прогиб в спине, но таз обязательно должен быть прижат к скамье; \n" +
                    "Подконтрольно на 2 счёта опустите гриф вниз, слегка коснитесь им верха груди; \n" +
                    "На 1 счёт выжмите штангу вверх, выпрямив локти; \n" +
                    "в нижнем положении предплечья перпендикулярны полу, а локти слегка выведены вперёд, лопатки сведены, грудь вперёд; \n" +
                    "Обязательно сжимайте грудные мышцы в верхней точке, старайтесь прочувствовать их работу; \n" +
                    "Во время выполнения упражнения давите ногами в пол, держите в напряжении всё тело.\n" +
                    "2. Сведение рук в кроссовере\n" +
                    "  Возьмитесь за рукоятки блоков, локти чуть согнуты вперёд; \n" +
                    "Одну ногу немного выставите вперёд корпус слегка наклонён вперёд, спина прямая; \n" +
                    "Сведите руки так, чтобы кисти были на уровне низа живота; \n" +
                    "Разведите руки, держа мышцы в напряжении, а не по инерции; \n" +
                    "Не раскачивайтесь туловищем взад вперёд это уменьшает нагрузку на грудные мышцы.");
        });
        massHardHandsButton.setOnAction(event -> {
            textArea.setText("1. Разгибания с верхнего блока\n" +
                    "  Разгибайте руки движением вниз до касания бедер с задержкой для максимальной нагрузки. \n" +
                    "Медленным сгибанием возвращайте руки в исходное положение, прилагая определенное усилие. \n" +
                    "Вдох выполняется в первой фазе упражнения с фиксацией локтей в одном положении.\n" +
                    "2. Попеременный подъем гантелей в положении сидя\n" +
                    " Расположитесь удобно на скамье и опустить вниз прямые руки. \n" +
                    "Туловище остается прямым, во избежание округления позвоночника. \n" +
                    "Гантели поднимайте к плечу и опускаются вниз без паузы.");
        });
        massHardLegsButton.setOnAction(event ->{
            textArea.setText("1. Жим ногами\n" +
                    "  Чем шире постановка ног и чем ближе пятки к краю платформы, тем сильнее задействованы приводящие (внутренняя часть бедра) и ягодичные мышцы. \n" +
                    "Если у вас сводит колени во время приседаний, значит приводящие мышцы бедра слабые. \n" +
                    "Не отрывайте поясницу от тренажёра, иначе она получает ненужную нагрузку и можно получить травму.\n" +
                    "2. Румынская становая тяга\n" +
                    "  Хват чуть шире плеч; \n" +
                    "Спина всё время остаётся прямой; \n" +
                    "Наклоняете спину вперёд и отведете ягодицы назад; \n" +
                    "Ноги немного согнуть в коленях; \n" +
                    "Штанга на пол не опускается, гриф доходит примерно до середины голени (вы должны почувствовать растяжение бицепса бедра); \n" +
                    "Гриф скользит по бёдрам и передней поверхности голени; \n" +
                    "Нельзя резко опускать и поднимать штангу, движения должны быть подконтрольными, а мышцы напряжены; в среднем поднимайте штангу быстрее, опускайте медленнее.\n");
        });
        massHardPressButton.setOnAction(event -> {
            textArea.setText("1. Скручивания в тренажёре\n" +
                    "  Сопротивление ставьте небольшое и постепенно увеличивайте его; \n" +
                    "Ноги заведите под валики, а руками возьмитесь за рукоятки; \n" +
                    "На выдохе напрягая пресс одновременно поднимите ноги и скрутите верх спины; \n" +
                    "Задержитесь на секунду и вернитесь в исходное положение.\n" +
                    "2. Подъём ног с упором на локти\n" +
                    "  Упритесь локтями в перекладины; \n" +
                    "Низ спины прижат к подушке тренажёра; \n" +
                    "Следите, чтобы плечи не притягивались к ушам; \n" +
                    "При подъёме ног старайтесь бедрами коснуться живота, поднять ноги выше параллели и оторвать низ спины от подушки тренажёра; \n" +
                    "Не раскачивайтесь и выполняйте упражнение за счёт мышц пресса, а не инерции.");
        });
        massHardBreastButton.setOnAction(event ->{
            textArea.setText("1. Пулловер с гантелью\n" +
                    "  Упритесь верхом спины в скамью; \n" +
                    "Гантель держите на вытянутых перед грудью руках (локти немного согнуты). \n" +
                    "Растягивая грудь, опустите гантель за голову вниз; \n" +
                    "Для лучшего растяжения мышц, во время опускания гантели также опускайте вниз таз.\n" +
                    "2. Наклонный жим штанги\n" +
                    "  Наклонный жим лёжа выполняется на скамье, поднятой под углом 30-40 градусов. \n" +
                    "При выполнении наклонного жима меньше нагрузки получают трицепсы и больше – дельты и верх грудных мышц. \n" +
                    "Общий вес на штанге будет меньше, чем при выполнении классического жима лёжа. \n" +
                    "В остальном, правильная техника выполнения – такая же, как и при жиме лёжа на горизонтальной скамье.");
        });
    }
}

